app/views/restaurant_pizzas/new.html.erb

SELECT "pizzas".* FROM "pizzas"
SELECT "restaurants".* FROM "restaurants"
---
    <p>Pizza:</p>
    <%= form.collection_select :pizza_id, Pizza.all, :id, :name %>
    <p>Restaurant: </p>
    <%= form.collection_select :restaurant_id, Restaurant.all, :id, :name %>