app/views/pizzas/index.html.erb

SELECT COUNT(*) FROM "restaurants" INNER JOIN "restaurant_pizzas" ON "restaurants"."id" = "restaurant_pizzas"."restaurant_id" WHERE "restaurant_pizzas"."pizza_id" = ?  [["pizza_id", 1]]
---
      <%= link_to pizza.name, pizza_path(pizza) %>
     <h3>Count: <%= pizza.restaurants.count %> </h3>