app/views/restaurants/show.html.erb

SELECT "restaurant_pizzas".* FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."restaurant_id" = ?  [["restaurant_id", 1]]
---
<ul>
    <% @restaurant.restaurant_pizzas.each do |r_p| %>