app/controllers/pizzas_controller.rb

  def index
    @pizzas = Pizza.all
---
SELECT "pizzas".* FROM "pizzas"

  def show
    @pizza = Pizza.find_by(id: params[:id])
---
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]