app/controllers/restaurant_pizzas_controller.rb

    def create
        @restaurant_pizza = RestaurantPizza.new(strong_params)
        if @restaurant_pizza.valid?
            @restaurant_pizza.save
---
INSERT INTO "restaurant_pizzas" ("price", "restaurant_id", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 10], ["restaurant_id", 1], ["pizza_id", 1], ["created_at", "2021-02-18 17:16:22.837784"], ["updated_at", "2021-02-18 17:16:22.837784"]]